; ModuleID = '/tmp/c-rust/borsh_llvm.fat.pp.ms.o.ul.bc'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%0 = type { %1 }
%1 = type { { i8*, i64 }, i64 }
%2 = type {}

@anon.3a351458387e3bc3eb95f33e633ad4c9.0 = private unnamed_addr constant <{ [2 x i8] }> <{ [2 x i8] c"ab" }>, align 1
@.str = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@llvm.used = appending global [4 x i8*] [i8* bitcast (void ()* @seahorn.fail to i8*), i8* bitcast (void (i1)* @verifier.assume to i8*), i8* bitcast (void (i1)* @verifier.assume.not to i8*), i8* bitcast (void ()* @verifier.error to i8*)], section "llvm.metadata"

; Function Attrs: nofree nosync nounwind readnone speculatable willreturn
declare void @llvm.dbg.declare(metadata, metadata, metadata) #0

; Function Attrs: argmemonly nofree nosync nounwind willreturn
declare void @llvm.lifetime.start.p0i8(i64 immarg, i8* nocapture) #1

; Function Attrs: nofree nosync nounwind readnone speculatable willreturn
declare void @llvm.dbg.value(metadata, metadata, metadata) #0

; Function Attrs: inaccessiblememonly nofree nosync nounwind willreturn
declare void @llvm.experimental.noalias.scope.decl(metadata) #2

; Function Attrs: argmemonly nofree nosync nounwind willreturn
declare void @llvm.lifetime.end.p0i8(i64 immarg, i8* nocapture) #1

; Function Attrs: nounwind uwtable

!97 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!98 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!99 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!100 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!101 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!102 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!103 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!104 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!105 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!106 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!107 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!108 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!109 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!110 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!111 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!112 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!113 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!114 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!115 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!116 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!117 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!118 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!119 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!120 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!121 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!122 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!123 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!124 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!125 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!126 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!127 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!128 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!129 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!130 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!131 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!132 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!133 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!134 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!135 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!136 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!137 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!138 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!139 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!140 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!141 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!142 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!143 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!144 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!145 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !146, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !147)
!146 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/1aw4n5vpxz2e3p3b", directory: "/home/bjancic/c-rust")
!147 = !{!24}
!148 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !149, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !150)
!149 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/15avrcz1fzbctyo5", directory: "/home/bjancic/c-rust")
!150 = !{!24, !12}
!151 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !152, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !153, globals: !154)
!152 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/1on2xnc0vs2jsbif", directory: "/home/bjancic/c-rust")
!153 = !{!76}
!154 = !{!155}
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "<std::error::{impl#3}::from::StringError as std::error::Error>::{vtable}", scope: null, file: !13, type: !157, isLocal: true, isDefinition: true)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<std::error::{impl#3}::from::StringError as std::error::Error>::{vtable_type}", file: !13, size: 768, align: 64, flags: DIFlagArtificial, elements: !158, vtableHolder: !174, templateParams: !208, identifier: "4815b2c287eb7d55e655e80050aefdae")
!158 = !{!159, !162, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !157, file: !13, baseType: !160, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !161, size: 64, align: 64, dwarfAddressSpace: 0)
!161 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !157, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!163 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !157, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !157, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !157, file: !13, baseType: !160, size: 64, align: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__super_trait_ptr5", scope: !157, file: !13, baseType: !160, size: 64, align: 64, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !157, file: !13, baseType: !160, size: 64, align: 64, offset: 384)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__method7", scope: !157, file: !13, baseType: !160, size: 64, align: 64, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__method8", scope: !157, file: !13, baseType: !160, size: 64, align: 64, offset: 512)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__method9", scope: !157, file: !13, baseType: !160, size: 64, align: 64, offset: 576)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__method10", scope: !157, file: !13, baseType: !160, size: 64, align: 64, offset: 640)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__method11", scope: !157, file: !13, baseType: !160, size: 64, align: 64, offset: 704)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StringError", scope: !175, file: !13, size: 192, align: 64, elements: !178, templateParams: !208, identifier: "b12a67bb48bea5ea3c2278ed8d0c21b2")
!175 = !DINamespace(name: "from", scope: !176)
!176 = !DINamespace(name: "{impl#3}", scope: !177)
!177 = !DINamespace(name: "error", scope: !27)
!178 = !{!179}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !174, file: !13, baseType: !180, size: 192, align: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !181, file: !13, size: 192, align: 64, elements: !183, templateParams: !208, identifier: "6eefd4e715fbb3fc5047a3c8849be53f")
!181 = !DINamespace(name: "string", scope: !182)
!182 = !DINamespace(name: "alloc", scope: null)
!183 = !{!184}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !180, file: !13, baseType: !185, size: 192, align: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !186, file: !13, size: 192, align: 64, elements: !187, templateParams: !213, identifier: "552260785b5950d2a959cfc0f4edc0bb")
!186 = !DINamespace(name: "vec", scope: !182)
!187 = !{!188, !215}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !185, file: !13, baseType: !189, size: 128, align: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !190, file: !13, size: 128, align: 64, elements: !191, templateParams: !213, identifier: "6f09d5cbc54fc502bda85e4d76924cc7")
!190 = !DINamespace(name: "raw_vec", scope: !182)
!191 = !{!192, !209, !210}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !189, file: !13, baseType: !193, size: 64, align: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !194, file: !13, size: 64, align: 64, elements: !196, templateParams: !203, identifier: "a420bf376d0fc58e3753110e3568a5f")
!194 = !DINamespace(name: "unique", scope: !195)
!195 = !DINamespace(name: "ptr", scope: !17)
!196 = !{!197, !205}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !193, file: !13, baseType: !198, size: 64, align: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !199, file: !13, size: 64, align: 64, elements: !200, templateParams: !203, identifier: "e7f669e943ccb7e83e7aaf6bdb0fff08")
!199 = !DINamespace(name: "non_null", scope: !195)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !198, file: !13, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!203 = !{!204}
!204 = !DITemplateTypeParameter(name: "T", type: !18)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !193, file: !13, baseType: !206, align: 8)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !207, file: !13, align: 8, elements: !208, templateParams: !203, identifier: "ca510041e9770ab4b134f5240866b787")
!207 = !DINamespace(name: "marker", scope: !17)
!208 = !{}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !189, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !189, file: !13, baseType: !211, align: 8)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !212, file: !13, align: 8, elements: !208, identifier: "c2bfe0cdcc3dd61d27d867949810a194")
!212 = !DINamespace(name: "alloc", scope: !182)
!213 = !{!204, !214}
!214 = !DITemplateTypeParameter(name: "A", type: !211)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !185, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!216 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !217, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!217 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/2vdgkfdcf1norvgp", directory: "/home/bjancic/c-rust")
!218 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !219, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !220)
!219 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/3dbb6i8b6sdmn0xh", directory: "/home/bjancic/c-rust")
!220 = !{!221, !12, !76, !228, !234}
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !222, file: !13, baseType: !223, size: 8, align: 8, flags: DIFlagEnumClass, elements: !224)
!222 = !DINamespace(name: "cmp", scope: !17)
!223 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!224 = !{!225, !226, !227}
!225 = !DIEnumerator(name: "Less", value: 255)
!226 = !DIEnumerator(name: "Equal", value: 0)
!227 = !DIEnumerator(name: "Greater", value: 1)
!228 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !229, file: !13, baseType: !18, size: 8, align: 8, flags: DIFlagEnumClass, elements: !230)
!229 = !DINamespace(name: "panicking", scope: !17)
!230 = !{!231, !232, !233}
!231 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!232 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!233 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !190, file: !13, baseType: !18, size: 8, align: 8, flags: DIFlagEnumClass, elements: !235)
!235 = !{!236, !237}
!236 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!237 = !DIEnumerator(name: "Zeroed", value: 1, isUnsigned: true)
!238 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !239, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!239 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/399w9gslwidi29zi", directory: "/home/bjancic/c-rust")
!240 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !241, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !242)
!241 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/3ecwmuxsiweex6fj", directory: "/home/bjancic/c-rust")
!242 = !{!243}
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !244, file: !13, baseType: !18, size: 8, align: 8, flags: DIFlagEnumClass, elements: !245)
!244 = !DINamespace(name: "ffi", scope: !17)
!245 = !{!246, !247}
!246 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!247 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!248 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !249, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!249 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/1rarfek8md9e4aao", directory: "/home/bjancic/c-rust")
!250 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !251, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !72)
!251 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/3t3ubtasyjkbxfo1", directory: "/home/bjancic/c-rust")
!252 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !253, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!253 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/3tfiirpdo14x79nq", directory: "/home/bjancic/c-rust")
!254 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !255, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !72)
!255 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/3yad94icdqkrfey1", directory: "/home/bjancic/c-rust")
!256 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !257, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!257 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/30nro1izsuk0twoh", directory: "/home/bjancic/c-rust")
!258 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !259, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !150)
!259 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/3zvnnwfe0okzgk06", directory: "/home/bjancic/c-rust")
!260 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !261, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !262)
!261 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/4tmdowjfiruqrekj", directory: "/home/bjancic/c-rust")
!262 = !{!24, !12, !228}
!263 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !264, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!264 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/4yygpwsoc7oopyys", directory: "/home/bjancic/c-rust")
!265 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !266, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !267, globals: !268)
!266 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/51ycsqok29cd0klt", directory: "/home/bjancic/c-rust")
!267 = !{!228, !12}
!268 = !{!269}
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !271, isLocal: true, isDefinition: true)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&usize as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !272, vtableHolder: !277, templateParams: !208, identifier: "6d8ba1d966af98fc1b124f72b413b70f")
!272 = !{!273, !274, !275, !276}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !271, file: !13, baseType: !160, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !271, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !271, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !271, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !163, size: 64, align: 64, dwarfAddressSpace: 0)
!278 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !279, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !72)
!279 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/3359vmqdlqnufx73", directory: "/home/bjancic/c-rust")
!280 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !281, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !147)
!281 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/5g1f08d3yluswlij", directory: "/home/bjancic/c-rust")
!282 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !283, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !153, globals: !284)
!283 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/2v6zie9oibq6eua4", directory: "/home/bjancic/c-rust")
!284 = !{!285}
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "<std::error::{impl#3}::from::StringError as std::error::Error>::{vtable}", scope: null, file: !13, type: !157, isLocal: true, isDefinition: true)
!287 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !288, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!288 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/iysf940ka47rwjc", directory: "/home/bjancic/c-rust")
!289 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !290, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !153)
!290 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/numx20zple7n350", directory: "/home/bjancic/c-rust")
!291 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !292, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!292 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/wlu0ehw4z8he9mo", directory: "/home/bjancic/c-rust")
!293 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !294, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!294 = !DIFile(filename: "src/rust-jobs/borsh/lib.rs/@/4e11idthatbsycqj", directory: "/home/bjancic/c-rust")
!295 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !296, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!296 = !DIFile(filename: "src/sea-lib/src/lib.rs/@/fa1kvqrvbp544zi", directory: "/home/bjancic/c-rust")
!297 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !298, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!298 = !DIFile(filename: "src/sea-lib/src/lib.rs/@/47o1s4tfpxazsfxf", directory: "/home/bjancic/c-rust")
!299 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !300, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !301)
!300 = !DIFile(filename: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3/src/lib.rs/@/borsh.0121326a-cgu.11", directory: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3")
!301 = !{!24, !12, !243, !76}
!302 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !303, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !220)
!303 = !DIFile(filename: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3/src/lib.rs/@/borsh.0121326a-cgu.1", directory: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3")
!304 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !305, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !267, globals: !306)
!305 = !DIFile(filename: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3/src/lib.rs/@/borsh.0121326a-cgu.12", directory: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3")
!306 = !{!307, !316, !416}
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !309, isLocal: true, isDefinition: true)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !310, vtableHolder: !315, templateParams: !208, identifier: "c0775cfe865d0a13fdc77ed5cae67b7")
!310 = !{!311, !312, !313, !314}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !309, file: !13, baseType: !160, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !309, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !309, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !309, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "<&&borsh::schema::Definition as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !318, isLocal: true, isDefinition: true)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&&borsh::schema::Definition as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !319, vtableHolder: !324, templateParams: !208, identifier: "1166874a146b89fc1092760ed4f5d935")
!319 = !{!320, !321, !322, !323}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !318, file: !13, baseType: !160, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !318, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !318, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !318, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&borsh::schema::Definition", baseType: !325, size: 64, align: 64, dwarfAddressSpace: 0)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&borsh::schema::Definition", baseType: !326, size: 64, align: 64, dwarfAddressSpace: 0)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Definition", scope: !327, file: !13, size: 320, align: 64, elements: !329, templateParams: !208, identifier: "df7d3a33372160ce111d8e06a846fed9")
!327 = !DINamespace(name: "schema", scope: !328)
!328 = !DINamespace(name: "borsh", scope: null)
!329 = !{!330}
!330 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !326, file: !13, size: 320, align: 64, elements: !331, templateParams: !208, identifier: "fb604db687bde2dd1958472d5ded9003", discriminator: !415)
!331 = !{!332, !338, !342, !367, !396}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Array", scope: !330, file: !13, baseType: !333, size: 320, align: 64, extraData: i64 0)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Array", scope: !326, file: !13, size: 320, align: 64, elements: !334, templateParams: !208, identifier: "beb6990d643d6aa4d6af7f969fee4fc8")
!334 = !{!335, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !333, file: !13, baseType: !336, size: 32, align: 32, offset: 32)
!336 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !333, file: !13, baseType: !180, size: 192, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Sequence", scope: !330, file: !13, baseType: !339, size: 320, align: 64, extraData: i64 1)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", scope: !326, file: !13, size: 320, align: 64, elements: !340, templateParams: !208, identifier: "314b1a3793f99ae080d044609641bac2")
!340 = !{!341}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !339, file: !13, baseType: !180, size: 192, align: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Tuple", scope: !330, file: !13, baseType: !343, size: 320, align: 64, extraData: i64 2)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple", scope: !326, file: !13, size: 320, align: 64, elements: !344, templateParams: !208, identifier: "7528f53eafa876a0163b00b688bcaf92")
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !343, file: !13, baseType: !346, size: 192, align: 64, offset: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<alloc::string::String, alloc::alloc::Global>", scope: !186, file: !13, size: 192, align: 64, elements: !347, templateParams: !365, identifier: "ca932a4a488e4556dbc50de54a0aa90")
!347 = !{!348, !366}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !346, file: !13, baseType: !349, size: 128, align: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<alloc::string::String, alloc::alloc::Global>", scope: !190, file: !13, size: 128, align: 64, elements: !350, templateParams: !365, identifier: "568b3b52b758efe1fd72ae10fcce789f")
!350 = !{!351, !363, !364}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !349, file: !13, baseType: !352, size: 64, align: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<alloc::string::String>", scope: !194, file: !13, size: 64, align: 64, elements: !353, templateParams: !359, identifier: "5d26638d2b26bed59074475f71c044d")
!353 = !{!354, !361}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !352, file: !13, baseType: !355, size: 64, align: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::string::String>", scope: !199, file: !13, size: 64, align: 64, elements: !356, templateParams: !359, identifier: "430b2947e564c5e1f4d61beb8a5b6fca")
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !355, file: !13, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::string::String", baseType: !180, size: 64, align: 64, dwarfAddressSpace: 0)
!359 = !{!360}
!360 = !DITemplateTypeParameter(name: "T", type: !180)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !352, file: !13, baseType: !362, align: 8)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::string::String>", scope: !207, file: !13, align: 8, elements: !208, templateParams: !359, identifier: "59eff2476c6cc184bd8d3c73e2131591")
!363 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !349, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !349, file: !13, baseType: !211, align: 8)
!365 = !{!360, !214}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !346, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Enum", scope: !330, file: !13, baseType: !368, size: 320, align: 64, extraData: i64 3)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Enum", scope: !326, file: !13, size: 320, align: 64, elements: !369, templateParams: !208, identifier: "94a75e50305d68593e4b0e692c8ff6e3")
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "variants", scope: !368, file: !13, baseType: !371, size: 192, align: 64, offset: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<(alloc::string::String, alloc::string::String), alloc::alloc::Global>", scope: !186, file: !13, size: 192, align: 64, elements: !372, templateParams: !394, identifier: "3e5871ee63da16e61e47e18fdb460d16")
!372 = !{!373, !395}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !371, file: !13, baseType: !374, size: 128, align: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<(alloc::string::String, alloc::string::String), alloc::alloc::Global>", scope: !190, file: !13, size: 128, align: 64, elements: !375, templateParams: !394, identifier: "83b68a19a48c45cebb263506ca7b3dd2")
!375 = !{!376, !392, !393}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !374, file: !13, baseType: !377, size: 64, align: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<(alloc::string::String, alloc::string::String)>", scope: !194, file: !13, size: 64, align: 64, elements: !378, templateParams: !388, identifier: "a17ed0f43ca9b12b9d8be90ecb86ab84")
!378 = !{!379, !390}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !377, file: !13, baseType: !380, size: 64, align: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<(alloc::string::String, alloc::string::String)>", scope: !199, file: !13, size: 64, align: 64, elements: !381, templateParams: !388, identifier: "261fc9010c5fa68f5476efe76de2e1c9")
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !380, file: !13, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const (alloc::string::String, alloc::string::String)", baseType: !384, size: 64, align: 64, dwarfAddressSpace: 0)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::string::String, alloc::string::String)", file: !13, size: 384, align: 64, elements: !385, templateParams: !208, identifier: "ebc3c70096c9c84a13987cd45a107229")
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !384, file: !13, baseType: !180, size: 192, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !384, file: !13, baseType: !180, size: 192, align: 64, offset: 192)
!388 = !{!389}
!389 = !DITemplateTypeParameter(name: "T", type: !384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !377, file: !13, baseType: !391, align: 8)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(alloc::string::String, alloc::string::String)>", scope: !207, file: !13, align: 8, elements: !208, templateParams: !388, identifier: "c92757a236c4195929d1f4508229940f")
!392 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !374, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !374, file: !13, baseType: !211, align: 8)
!394 = !{!389, !214}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !371, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "Struct", scope: !330, file: !13, baseType: !397, size: 320, align: 64, extraData: i64 4)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Struct", scope: !326, file: !13, size: 320, align: 64, elements: !398, templateParams: !208, identifier: "3f5d6c4a65b9dfd890119d5cfb5db9d8")
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !397, file: !13, baseType: !400, size: 256, align: 64, offset: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Fields", scope: !327, file: !13, size: 256, align: 64, elements: !401, templateParams: !208, identifier: "3a1cd7d2500775a2e0847636fb5fc6b8")
!401 = !{!402}
!402 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !400, file: !13, size: 256, align: 64, elements: !403, templateParams: !208, identifier: "95398bc07624a907dae84d9a372bcda9", discriminator: !414)
!403 = !{!404, !408, !412}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "NamedFields", scope: !402, file: !13, baseType: !405, size: 256, align: 64, extraData: i64 0)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NamedFields", scope: !400, file: !13, size: 256, align: 64, elements: !406, templateParams: !208, identifier: "2fa03e289d9a7d26e54456143a2ac78b")
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !405, file: !13, baseType: !371, size: 192, align: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "UnnamedFields", scope: !402, file: !13, baseType: !409, size: 256, align: 64, extraData: i64 1)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnnamedFields", scope: !400, file: !13, size: 256, align: 64, elements: !410, templateParams: !208, identifier: "b15cedc85544cba572ca005b56ac5cd3")
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !409, file: !13, baseType: !346, size: 192, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "Empty", scope: !402, file: !13, baseType: !413, size: 256, align: 64, extraData: i64 2)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Empty", scope: !400, file: !13, size: 256, align: 64, elements: !208, identifier: "986c460c054df1b51466974620caafb")
!414 = !DIDerivedType(tag: DW_TAG_member, scope: !400, file: !13, baseType: !79, size: 64, align: 64, flags: DIFlagArtificial)
!415 = !DIDerivedType(tag: DW_TAG_member, scope: !326, file: !13, baseType: !336, size: 32, align: 32, flags: DIFlagArtificial)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !271, isLocal: true, isDefinition: true)
!418 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !419, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !420, globals: !421)
!419 = !DIFile(filename: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3/src/lib.rs/@/borsh.0121326a-cgu.0", directory: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3")
!420 = !{!12, !76, !228}
!421 = !{!422, !431, !440, !449, !458, !467}
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "<&borsh::schema::Fields as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !424, isLocal: true, isDefinition: true)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&borsh::schema::Fields as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !425, vtableHolder: !430, templateParams: !208, identifier: "6d2dc5213cfd15bf726992baeee301cb")
!425 = !{!426, !427, !428, !429}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !424, file: !13, baseType: !160, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !424, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !424, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !424, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&borsh::schema::Fields", baseType: !400, size: 64, align: 64, dwarfAddressSpace: 0)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "<&alloc::vec::Vec<(alloc::string::String, alloc::string::String), alloc::alloc::Global> as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !433, isLocal: true, isDefinition: true)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&alloc::vec::Vec<(alloc::string::String, alloc::string::String), alloc::alloc::Global> as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !434, vtableHolder: !439, templateParams: !208, identifier: "670fb394333c4ea5840ec6beaf6deca0")
!434 = !{!435, !436, !437, !438}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !433, file: !13, baseType: !160, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !433, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !433, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !433, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::vec::Vec<(alloc::string::String, alloc::string::String), alloc::alloc::Global>", baseType: !371, size: 64, align: 64, dwarfAddressSpace: 0)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "<&alloc::vec::Vec<alloc::string::String, alloc::alloc::Global> as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !442, isLocal: true, isDefinition: true)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&alloc::vec::Vec<alloc::string::String, alloc::alloc::Global> as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !443, vtableHolder: !448, templateParams: !208, identifier: "57dbf12a8cd58d151372308999f14537")
!443 = !{!444, !445, !446, !447}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !442, file: !13, baseType: !160, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !442, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !442, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !442, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::vec::Vec<alloc::string::String, alloc::alloc::Global>", baseType: !346, size: 64, align: 64, dwarfAddressSpace: 0)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "<&alloc::string::String as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !451, isLocal: true, isDefinition: true)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&alloc::string::String as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !452, vtableHolder: !457, templateParams: !208, identifier: "ba9860727f3935d12075f80517f4639f")
!452 = !{!453, !454, !455, !456}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !451, file: !13, baseType: !160, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !451, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !451, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !451, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::string::String", baseType: !180, size: 64, align: 64, dwarfAddressSpace: 0)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !460, isLocal: true, isDefinition: true)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !461, vtableHolder: !466, templateParams: !208, identifier: "1dfdf3aa9774b81d9c7a3f5d8b4a188e")
!461 = !{!462, !463, !464, !465}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !460, file: !13, baseType: !160, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !460, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !460, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !460, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !336, size: 64, align: 64, dwarfAddressSpace: 0)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "<&std::collections::hash::map::HashMap<alloc::string::String, borsh::schema::Definition, std::collections::hash::map::RandomState> as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !469, isLocal: true, isDefinition: true)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&std::collections::hash::map::HashMap<alloc::string::String, borsh::schema::Definition, std::collections::hash::map::RandomState> as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !470, vtableHolder: !475, templateParams: !208, identifier: "4673c663495e12141c01e8bab9c83de")
!470 = !{!471, !472, !473, !474}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !469, file: !13, baseType: !160, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !469, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !469, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !469, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::collections::hash::map::HashMap<alloc::string::String, borsh::schema::Definition, std::collections::hash::map::RandomState>", baseType: !476, size: 64, align: 64, dwarfAddressSpace: 0)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::string::String, borsh::schema::Definition, std::collections::hash::map::RandomState>", scope: !477, file: !13, size: 384, align: 64, elements: !480, templateParams: !517, identifier: "9942d045c2d046bd7b4461db68aca21")
!477 = !DINamespace(name: "map", scope: !478)
!478 = !DINamespace(name: "hash", scope: !479)
!479 = !DINamespace(name: "collections", scope: !27)
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !476, file: !13, baseType: !482, size: 384, align: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HashMap<alloc::string::String, borsh::schema::Definition, std::collections::hash::map::RandomState, alloc::alloc::Global>", scope: !483, file: !13, size: 384, align: 64, elements: !485, templateParams: !513, identifier: "76af973a55b054284ea2f52ed05ae56e")
!483 = !DINamespace(name: "map", scope: !484)
!484 = !DINamespace(name: "hashbrown", scope: null)
!485 = !{!486, !491}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "hash_builder", scope: !482, file: !13, baseType: !487, size: 128, align: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RandomState", scope: !477, file: !13, size: 128, align: 64, elements: !488, templateParams: !208, identifier: "dbebed32d8b7fea08710b09aefea9595")
!488 = !{!489, !490}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "k0", scope: !487, file: !13, baseType: !79, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !487, file: !13, baseType: !79, size: 64, align: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !482, file: !13, baseType: !492, size: 256, align: 64, offset: 128)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawTable<(alloc::string::String, borsh::schema::Definition), alloc::alloc::Global>", scope: !493, file: !13, size: 256, align: 64, elements: !494, templateParams: !512, identifier: "34388f9bdd28fa44c057fe960174b55")
!493 = !DINamespace(name: "raw", scope: !484)
!494 = !{!495, !504}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !492, file: !13, baseType: !496, size: 256, align: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawTableInner<alloc::alloc::Global>", scope: !493, file: !13, size: 256, align: 64, elements: !497, templateParams: !503, identifier: "8760d4983ee4c8f042fb5c53396f580c")
!497 = !{!498, !499, !500, !501, !502}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_mask", scope: !496, file: !13, baseType: !163, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !496, file: !13, baseType: !198, size: 64, align: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "growth_left", scope: !496, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !496, file: !13, baseType: !163, size: 64, align: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !496, file: !13, baseType: !211, align: 8)
!503 = !{!214}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !492, file: !13, baseType: !505, align: 8)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<(alloc::string::String, borsh::schema::Definition)>", scope: !207, file: !13, align: 8, elements: !208, templateParams: !506, identifier: "a7e88c19b048c6bf2e74654ecfbc73eb")
!506 = !{!507}
!507 = !DITemplateTypeParameter(name: "T", type: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(alloc::string::String, borsh::schema::Definition)", file: !13, size: 512, align: 64, elements: !509, templateParams: !208, identifier: "d980eafb063835d721297d9fa99dc886")
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !508, file: !13, baseType: !180, size: 192, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !508, file: !13, baseType: !326, size: 320, align: 64, offset: 192)
!512 = !{!507, !214}
!513 = !{!514, !515, !516, !214}
!514 = !DITemplateTypeParameter(name: "K", type: !180)
!515 = !DITemplateTypeParameter(name: "V", type: !326)
!516 = !DITemplateTypeParameter(name: "S", type: !487)
!517 = !{!514, !515, !516}
!518 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !519, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !520)
!519 = !DIFile(filename: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3/src/lib.rs/@/borsh.0121326a-cgu.14", directory: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3")
!520 = !{!76, !24, !12}
!521 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !522, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !523)
!522 = !DIFile(filename: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3/src/lib.rs/@/borsh.0121326a-cgu.15", directory: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3")
!523 = !{!221, !76}
!524 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !525, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!525 = !DIFile(filename: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3/src/lib.rs/@/borsh.0121326a-cgu.13", directory: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3")
!526 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !527, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !528, globals: !533)
!527 = !DIFile(filename: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3/src/lib.rs/@/borsh.0121326a-cgu.2", directory: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3")
!528 = !{!221, !12, !76, !529, !228}
!529 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fallibility", scope: !493, file: !13, baseType: !18, size: 8, align: 8, flags: DIFlagEnumClass, elements: !530)
!530 = !{!531, !532}
!531 = !DIEnumerator(name: "Fallible", value: 0, isUnsigned: true)
!532 = !DIEnumerator(name: "Infallible", value: 1, isUnsigned: true)
!533 = !{!534}
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "<hashbrown::raw::{impl#7}::reserve_rehash::{closure_env#0}<(alloc::string::String, borsh::schema::Definition), alloc::alloc::Global, hashbrown::map::make_hasher::{closure_env#0}<alloc::string::String, alloc::string::String, borsh::schema::Definition, std::collections::hash::map::RandomState>> as core::ops::function::Fn<(&mut hashbrown::raw::RawTableInner<alloc::alloc::Global>, usize)>>::{vtable}", scope: null, file: !13, type: !536, isLocal: true, isDefinition: true)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<hashbrown::raw::{impl#7}::reserve_rehash::{closure_env#0}<(alloc::string::String, borsh::schema::Definition), alloc::alloc::Global, hashbrown::map::make_hasher::{closure_env#0}<alloc::string::String, alloc::string::String, borsh::schema::Definition, std::collections::hash::map::RandomState>> as core::ops::function::Fn<(&mut hashbrown::raw::RawTableInner<alloc::alloc::Global>, usize)>>::{vtable_type}", file: !13, size: 384, align: 64, flags: DIFlagArtificial, elements: !537, vtableHolder: !544, templateParams: !208, identifier: "fe2e4c7eefec531b31879d4e9cb8381c")
!537 = !{!538, !539, !540, !541, !542, !543}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !536, file: !13, baseType: !160, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !536, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !536, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !536, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !536, file: !13, baseType: !160, size: 64, align: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !536, file: !13, baseType: !160, size: 64, align: 64, offset: 320)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<(alloc::string::String, borsh::schema::Definition), alloc::alloc::Global, hashbrown::map::make_hasher::{closure_env#0}<alloc::string::String, alloc::string::String, borsh::schema::Definition, std::collections::hash::map::RandomState>>", scope: !545, file: !13, size: 64, align: 64, elements: !547, templateParams: !208, identifier: "78e3a5c63131a841444dffa3e1ca177f")
!545 = !DINamespace(name: "reserve_rehash", scope: !546)
!546 = !DINamespace(name: "{impl#7}", scope: !493)
!547 = !{!548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__hasher", scope: !544, file: !13, baseType: !549, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&hashbrown::map::make_hasher::{closure_env#0}<alloc::string::String, alloc::string::String, borsh::schema::Definition, std::collections::hash::map::RandomState>", baseType: !550, size: 64, align: 64, dwarfAddressSpace: 0)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<alloc::string::String, alloc::string::String, borsh::schema::Definition, std::collections::hash::map::RandomState>", scope: !551, file: !13, size: 64, align: 64, elements: !552, templateParams: !208, identifier: "c895ee20f7c7515139a1d68f2f1a455")
!551 = !DINamespace(name: "make_hasher", scope: !483)
!552 = !{!553}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "hash_builder", scope: !550, file: !13, baseType: !554, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::collections::hash::map::RandomState", baseType: !487, size: 64, align: 64, dwarfAddressSpace: 0)
!555 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !556, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !420, globals: !557)
!556 = !DIFile(filename: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3/src/lib.rs/@/borsh.0121326a-cgu.4", directory: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3")
!557 = !{!558}
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "<&alloc::string::String as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !451, isLocal: true, isDefinition: true)
!560 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !561, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !72, globals: !562)
!561 = !DIFile(filename: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3/src/lib.rs/@/borsh.0121326a-cgu.10", directory: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3")
!562 = !{!563, !565, !573}
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "<&alloc::string::String as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !451, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "<&borsh::schema::Definition as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !567, isLocal: true, isDefinition: true)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&borsh::schema::Definition as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !568, vtableHolder: !325, templateParams: !208, identifier: "526881ae7f35c5e8d2f01d73bcb1bf05")
!568 = !{!569, !570, !571, !572}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !567, file: !13, baseType: !160, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !567, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !567, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !567, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "<&(alloc::string::String, alloc::string::String) as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !575, isLocal: true, isDefinition: true)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&(alloc::string::String, alloc::string::String) as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !576, vtableHolder: !581, templateParams: !208, identifier: "e7506aa2e083525d110869b7a6a51de3")
!576 = !{!577, !578, !579, !580}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !575, file: !13, baseType: !160, size: 64, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !575, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !575, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !575, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(alloc::string::String, alloc::string::String)", baseType: !384, size: 64, align: 64, dwarfAddressSpace: 0)
!582 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !583, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !72)
!583 = !DIFile(filename: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3/src/lib.rs/@/borsh.0121326a-cgu.3", directory: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3")
!584 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !585, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !586)
!585 = !DIFile(filename: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3/src/lib.rs/@/borsh.0121326a-cgu.5", directory: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3")
!586 = !{!12, !228}
!587 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !588, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !72)
!588 = !DIFile(filename: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3/src/lib.rs/@/borsh.0121326a-cgu.6", directory: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3")
!589 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !590, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !591)
!590 = !DIFile(filename: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3/src/lib.rs/@/borsh.0121326a-cgu.7", directory: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3")
!591 = !{!12, !221, !228}
!592 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !593, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !153, globals: !594)
!593 = !DIFile(filename: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3/src/lib.rs/@/borsh.0121326a-cgu.8", directory: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3")
!594 = !{!595}
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "<std::error::{impl#3}::from::StringError as std::error::Error>::{vtable}", scope: null, file: !13, type: !157, isLocal: true, isDefinition: true)
!597 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !598, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !599, globals: !600)
!598 = !DIFile(filename: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3/src/lib.rs/@/borsh.0121326a-cgu.9", directory: "/home/bjancic/.cargo/registry/src/github.com-1ecc6299db9ec823/borsh-0.10.3")
!599 = !{!221, !12, !228}
!600 = !{!601}
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "<hashbrown::raw::{impl#7}::find::{closure_env#0}<(alloc::string::String, borsh::schema::Definition), alloc::alloc::Global, hashbrown::rustc_entry::{impl#0}::rustc_entry::{closure_env#0}<alloc::string::String, borsh::schema::Definition, std::collections::hash::map::RandomState, alloc::alloc::Global>> as core::ops::function::FnMut<(usize)>>::{vtable}", scope: null, file: !13, type: !603, isLocal: true, isDefinition: true)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<hashbrown::raw::{impl#7}::find::{closure_env#0}<(alloc::string::String, borsh::schema::Definition), alloc::alloc::Global, hashbrown::rustc_entry::{impl#0}::rustc_entry::{closure_env#0}<alloc::string::String, borsh::schema::Definition, std::collections::hash::map::RandomState, alloc::alloc::Global>> as core::ops::function::FnMut<(usize)>>::{vtable_type}", file: !13, size: 320, align: 64, flags: DIFlagArtificial, elements: !604, vtableHolder: !610, templateParams: !208, identifier: "108582e26fa64b71acaa4f2afbd576bc")
!604 = !{!605, !606, !607, !608, !609}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !603, file: !13, baseType: !160, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !603, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !603, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !603, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !603, file: !13, baseType: !160, size: 64, align: 64, offset: 256)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<(alloc::string::String, borsh::schema::Definition), alloc::alloc::Global, hashbrown::rustc_entry::{impl#0}::rustc_entry::{closure_env#0}<alloc::string::String, borsh::schema::Definition, std::collections::hash::map::RandomState, alloc::alloc::Global>>", scope: !611, file: !13, size: 128, align: 64, elements: !612, templateParams: !208, identifier: "763ae7cd81a7a19dd1edfe17cfa1e85d")
!611 = !DINamespace(name: "find", scope: !546)
!612 = !{!613, !621}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__eq", scope: !610, file: !13, baseType: !614, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut hashbrown::rustc_entry::{impl#0}::rustc_entry::{closure_env#0}<alloc::string::String, borsh::schema::Definition, std::collections::hash::map::RandomState, alloc::alloc::Global>", baseType: !615, size: 64, align: 64, dwarfAddressSpace: 0)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<alloc::string::String, borsh::schema::Definition, std::collections::hash::map::RandomState, alloc::alloc::Global>", scope: !616, file: !13, size: 64, align: 64, elements: !619, templateParams: !208, identifier: "c04aff54f6d275d4a70dcf5582a0b8a9")
!616 = !DINamespace(name: "rustc_entry", scope: !617)
!617 = !DINamespace(name: "{impl#0}", scope: !618)
!618 = !DINamespace(name: "rustc_entry", scope: !484)
!619 = !{!620}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__key", scope: !615, file: !13, baseType: !457, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__self", scope: !610, file: !13, baseType: !622, size: 64, align: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&hashbrown::raw::RawTable<(alloc::string::String, borsh::schema::Definition), alloc::alloc::Global>", baseType: !492, size: 64, align: 64, dwarfAddressSpace: 0)
!623 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !624, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !625, globals: !661)
!624 = !DIFile(filename: "/home/bjancic/.rustup/toolchains/nightly-2022-08-01-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/std/src/lib.rs/@/std.1365de47-cgu.11", directory: "/home/bjancic/.rustup/toolchains/nightly-2022-08-01-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/std")
!625 = !{!626, !243, !12, !221, !24, !635, !643, !652, !76, !228}
!626 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "EscapeUnicodeState", scope: !627, file: !13, baseType: !18, size: 8, align: 8, flags: DIFlagEnumClass, elements: !628)
!627 = !DINamespace(name: "char", scope: !17)
!628 = !{!629, !630, !631, !632, !633, !634}
!629 = !DIEnumerator(name: "Done", value: 0, isUnsigned: true)
!630 = !DIEnumerator(name: "RightBrace", value: 1, isUnsigned: true)
!631 = !DIEnumerator(name: "Value", value: 2, isUnsigned: true)
!632 = !DIEnumerator(name: "LeftBrace", value: 3, isUnsigned: true)
!633 = !DIEnumerator(name: "Type", value: 4, isUnsigned: true)
!634 = !DIEnumerator(name: "Backslash", value: 5, isUnsigned: true)
!635 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Cgroup", scope: !636, file: !13, baseType: !18, size: 8, align: 8, flags: DIFlagEnumClass, elements: !640)
!636 = !DINamespace(name: "cgroups", scope: !637)
!637 = !DINamespace(name: "thread", scope: !638)
!638 = !DINamespace(name: "unix", scope: !639)
!639 = !DINamespace(name: "sys", scope: !27)
!640 = !{!641, !642}
!641 = !DIEnumerator(name: "V1", value: 0, isUnsigned: true)
!642 = !DIEnumerator(name: "V2", value: 1, isUnsigned: true)
!643 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IntErrorKind", scope: !644, file: !13, baseType: !18, size: 8, align: 8, flags: DIFlagEnumClass, elements: !646)
!644 = !DINamespace(name: "error", scope: !645)
!645 = !DINamespace(name: "num", scope: !17)
!646 = !{!647, !648, !649, !650, !651}
!647 = !DIEnumerator(name: "Empty", value: 0, isUnsigned: true)
!648 = !DIEnumerator(name: "InvalidDigit", value: 1, isUnsigned: true)
!649 = !DIEnumerator(name: "PosOverflow", value: 2, isUnsigned: true)
!650 = !DIEnumerator(name: "NegOverflow", value: 3, isUnsigned: true)
!651 = !DIEnumerator(name: "Zero", value: 4, isUnsigned: true)
!652 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !653, file: !13, baseType: !18, size: 8, align: 8, flags: DIFlagEnumClass, elements: !655)
!653 = !DINamespace(name: "atomic", scope: !654)
!654 = !DINamespace(name: "sync", scope: !17)
!655 = !{!656, !657, !658, !659, !660}
!656 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!657 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!658 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!659 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!660 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!661 = !{!662, !673, !698, !707, !714}
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "<&mut alloc::string::String as core::fmt::Write>::{vtable}", scope: null, file: !13, type: !664, isLocal: true, isDefinition: true)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&mut alloc::string::String as core::fmt::Write>::{vtable_type}", file: !13, size: 384, align: 64, flags: DIFlagArtificial, elements: !665, vtableHolder: !672, templateParams: !208, identifier: "40d30b0392f57e23e5231db4f07ceb8e")
!665 = !{!666, !667, !668, !669, !670, !671}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !664, file: !13, baseType: !160, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !664, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !664, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !664, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !664, file: !13, baseType: !160, size: 64, align: 64, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !664, file: !13, baseType: !160, size: 64, align: 64, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::string::String", baseType: !180, size: 64, align: 64, dwarfAddressSpace: 0)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "INIT_LOCK", linkageName: "_ZN3std10sys_common16thread_local_key9StaticKey9lazy_init9INIT_LOCK17h3f0b4e10636b8d14E", scope: !675, file: !679, line: 160, type: !680, isLocal: true, isDefinition: true, align: 32)
!675 = !DINamespace(name: "lazy_init", scope: !676)
!676 = !DINamespace(name: "{impl#0}", scope: !677)
!677 = !DINamespace(name: "thread_local_key", scope: !678)
!678 = !DINamespace(name: "sys_common", scope: !27)
!679 = !DIFile(filename: "src/sys_common/thread_local_key.rs", directory: "/home/bjancic/.rustup/toolchains/nightly-2022-08-01-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/std", checksumkind: CSK_MD5, checksum: "9a2ce90105379dba933f36523d4a0bb8")
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StaticMutex", scope: !681, file: !13, size: 32, align: 32, elements: !682, templateParams: !208, identifier: "4fee2c22ab9714ecc4ef2490d415ad71")
!681 = !DINamespace(name: "mutex", scope: !678)
!682 = !{!683}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !680, file: !13, baseType: !684, size: 32, align: 32)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !685, file: !13, size: 32, align: 32, elements: !687, templateParams: !208, identifier: "8ee0f87e687e0ca5ee391f5dfd8c5d34")
!685 = !DINamespace(name: "futex_mutex", scope: !686)
!686 = !DINamespace(name: "locks", scope: !638)
!687 = !{!688}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !684, file: !13, baseType: !689, size: 32, align: 32)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU32", scope: !653, file: !13, size: 32, align: 32, elements: !690, templateParams: !208, identifier: "b23dfea0f2e2c8c6db0082af18860ce8")
!690 = !{!691}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !689, file: !13, baseType: !692, size: 32, align: 32)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u32>", scope: !693, file: !13, size: 32, align: 32, elements: !694, templateParams: !696, identifier: "d28e0b1c40bddf59b49c6bcbfd4fa3b")
!693 = !DINamespace(name: "cell", scope: !17)
!694 = !{!695}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !692, file: !13, baseType: !336, size: 32, align: 32)
!696 = !{!697}
!697 = !DITemplateTypeParameter(name: "T", type: !336)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "<i64 as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !700, isLocal: true, isDefinition: true)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<i64 as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !701, vtableHolder: !706, templateParams: !208, identifier: "5ecc2d5bb453f05099c61963b280c542")
!701 = !{!702, !703, !704, !705}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !700, file: !13, baseType: !160, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !700, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !700, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !700, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!706 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "VAL", linkageName: "_ZN3std10sys_common7remutex25current_thread_unique_ptr1X7__getit3VAL17ha14bbf8d566fe6cfE", scope: !709, file: !713, line: 209, type: !18, isLocal: true, isDefinition: true, align: 8)
!709 = !DINamespace(name: "__getit", scope: !710)
!710 = !DINamespace(name: "X", scope: !711)
!711 = !DINamespace(name: "current_thread_unique_ptr", scope: !712)
!712 = !DINamespace(name: "remutex", scope: !678)
!713 = !DIFile(filename: "src/thread/local.rs", directory: "/home/bjancic/.rustup/toolchains/nightly-2022-08-01-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/std", checksumkind: CSK_MD5, checksum: "09a480d3ff99b6a06356d8c51c76c786")
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "STATE", linkageName: "_ZN3std10sys_common7remutex25current_thread_unique_ptr1X7__getit5STATE17h1ed96e7c6c6baad3E", scope: !709, file: !713, line: 223, type: !18, isLocal: true, isDefinition: true, align: 8)
!716 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !717, producer: "clang LLVM (rustc version 1.64.0-nightly (f9cba6374 2022-07-31))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !718, globals: !740)
!717 = !DIFile(filename: "/home/bjancic/.rustup/toolchains/nightly-2022-08-01-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/std/src/lib.rs/@/std.1365de47-cgu.1", directory: "/home/bjancic/.rustup/toolchains/nightly-2022-08-01-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/std")
!718 = !{!12, !221, !24, !228, !719, !652, !76, !726, !243, !734}
!719 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "State", scope: !720, file: !13, baseType: !18, size: 8, align: 8, flags: DIFlagEnumClass, elements: !721)
!720 = !DINamespace(name: "path", scope: !27)
!721 = !{!722, !723, !724, !725}
!722 = !DIEnumerator(name: "Prefix", value: 0, isUnsigned: true)
!723 = !DIEnumerator(name: "StartDir", value: 1, isUnsigned: true)
!724 = !DIEnumerator(name: "Body", value: 2, isUnsigned: true)
!725 = !DIEnumerator(name: "Done", value: 3, isUnsigned: true)
!726 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DtorState", scope: !727, file: !13, baseType: !18, size: 8, align: 8, flags: DIFlagEnumClass, elements: !730)
!727 = !DINamespace(name: "fast", scope: !728)
!728 = !DINamespace(name: "local", scope: !729)
!729 = !DINamespace(name: "thread", scope: !27)
!730 = !{!731, !732, !733}
!731 = !DIEnumerator(name: "Unregistered", value: 0, isUnsigned: true)
!732 = !DIEnumerator(name: "Registered", value: 1, isUnsigned: true)
!733 = !DIEnumerator(name: "RunningOrHasRun", value: 2, isUnsigned: true)
!734 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Shutdown", scope: !735, file: !13, baseType: !18, size: 8, align: 8, flags: DIFlagEnumClass, elements: !736)
!735 = !DINamespace(name: "net", scope: !27)
!736 = !{!737, !738, !739}
!737 = !DIEnumerator(name: "Read", value: 0, isUnsigned: true)
!738 = !DIEnumerator(name: "Write", value: 1, isUnsigned: true)
!739 = !DIEnumerator(name: "Both", value: 2, isUnsigned: true)
!740 = !{!741, !757, !766, !780, !882, !902, !920, !946, !973, !986, !1036, !1055, !1064, !1073, !1085, !1094, !1096, !1110, !1150, !1163, !1186}
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "<std::fs::FileType as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !743, isLocal: true, isDefinition: true)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<std::fs::FileType as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !744, vtableHolder: !749, templateParams: !208, identifier: "f7cd2d57689ebbaf50a5ae404a924f66")
!744 = !{!745, !746, !747, !748}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !743, file: !13, baseType: !160, size: 64, align: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !743, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !743, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !743, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileType", scope: !750, file: !13, size: 32, align: 32, elements: !751, templateParams: !208, identifier: "478fc63e9facb88245db4a3d685fe75d")
!750 = !DINamespace(name: "fs", scope: !27)
!751 = !{!752}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !749, file: !13, baseType: !753, size: 32, align: 32)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileType", scope: !754, file: !13, size: 32, align: 32, elements: !755, templateParams: !208, identifier: "e7bc204e6adee24178275c7d4eb3c088")
!754 = !DINamespace(name: "fs", scope: !638)
!755 = !{!756}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !753, file: !13, baseType: !336, size: 32, align: 32)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !759, isLocal: true, isDefinition: true)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !760, vtableHolder: !765, templateParams: !208, identifier: "5e80b54720bd3757ccd0fc538403a42d")
!760 = !{!761, !762, !763, !764}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !759, file: !13, baseType: !160, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !759, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !759, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !759, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!765 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "<std::fs::Permissions as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !768, isLocal: true, isDefinition: true)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<std::fs::Permissions as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !769, vtableHolder: !774, templateParams: !208, identifier: "c75473dd936434d83800b5202596975")
!769 = !{!770, !771, !772, !773}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !768, file: !13, baseType: !160, size: 64, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !768, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !768, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !768, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Permissions", scope: !750, file: !13, size: 32, align: 32, elements: !775, templateParams: !208, identifier: "c04ed69313fb50a8b5da1afb05a169fc")
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !774, file: !13, baseType: !777, size: 32, align: 32)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FilePermissions", scope: !754, file: !13, size: 32, align: 32, elements: !778, templateParams: !208, identifier: "471c8c7d4d0848f320c703cc1880220f")
!778 = !{!779}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !777, file: !13, baseType: !336, size: 32, align: 32)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "<core::result::Result<std::time::SystemTime, std::io::error::Error> as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !782, isLocal: true, isDefinition: true)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<core::result::Result<std::time::SystemTime, std::io::error::Error> as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !783, vtableHolder: !788, templateParams: !208, identifier: "b8c82cf6a479868955e1dc201e33668b")
!783 = !{!784, !785, !786, !787}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !782, file: !13, baseType: !160, size: 64, align: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !782, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !782, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !782, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Result<std::time::SystemTime, std::io::error::Error>", scope: !789, file: !13, size: 192, align: 64, elements: !790, templateParams: !208, identifier: "6d349ea0945948d8933644863be54084")
!789 = !DINamespace(name: "result", scope: !17)
!790 = !{!791}
!791 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !788, file: !13, size: 192, align: 64, elements: !792, templateParams: !208, identifier: "a2957a0df73ecdeb80ab314e7c7ec417", discriminator: !881)
!792 = !{!793, !877}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !791, file: !13, baseType: !794, size: 192, align: 64, extraData: i64 0)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !788, file: !13, size: 192, align: 64, elements: !795, templateParams: !809, identifier: "7decf7ad94a636de88b132993cf68d37")
!795 = !{!796}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !794, file: !13, baseType: !797, size: 128, align: 64, offset: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SystemTime", scope: !798, file: !13, size: 128, align: 64, elements: !799, templateParams: !208, identifier: "d824e4bb97380ecc4359a36881f6221")
!798 = !DINamespace(name: "time", scope: !27)
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !797, file: !13, baseType: !801, size: 128, align: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SystemTime", scope: !802, file: !13, size: 128, align: 64, elements: !803, templateParams: !208, identifier: "5f3aed7149d8deff2c911fc350f8daa1")
!802 = !DINamespace(name: "time", scope: !638)
!803 = !{!804}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !801, file: !13, baseType: !805, size: 128, align: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Timespec", scope: !802, file: !13, size: 128, align: 64, elements: !806, templateParams: !208, identifier: "c445efea928b1b3aa16fcdaf0eff63be")
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !805, file: !13, baseType: !706, size: 64, align: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !805, file: !13, baseType: !706, size: 64, align: 64, offset: 64)
!809 = !{!810, !811}
!810 = !DITemplateTypeParameter(name: "T", type: !797)
!811 = !DITemplateTypeParameter(name: "E", type: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !25, file: !13, size: 64, align: 64, elements: !813, templateParams: !208, identifier: "77d05c9a08276679110cf1b543c4e773")
!813 = !{!814}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !812, file: !13, baseType: !815, size: 64, align: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !816, file: !13, size: 64, align: 64, elements: !817, templateParams: !208, identifier: "586909bf48dae8138f1a2683de0eb325")
!816 = !DINamespace(name: "repr_bitpacked", scope: !25)
!817 = !{!818, !824}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !815, file: !13, baseType: !819, size: 64, align: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !199, file: !13, size: 64, align: 64, elements: !820, templateParams: !822, identifier: "938f11168a8c2c3f744da51da95b0880")
!820 = !{!821}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !819, file: !13, baseType: !160, size: 64, align: 64)
!822 = !{!823}
!823 = !DITemplateTypeParameter(name: "T", type: !161)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !815, file: !13, baseType: !825, align: 8)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !207, file: !13, align: 8, elements: !208, templateParams: !826, identifier: "4b4a9430f45789ef29f22428ddabc78c")
!826 = !{!827}
!827 = !DITemplateTypeParameter(name: "T", type: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !25, file: !13, size: 128, align: 64, elements: !829, templateParams: !208, identifier: "a83b06998a92af3bedfe26fd7a40fe44")
!829 = !{!830}
!830 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !828, file: !13, size: 128, align: 64, elements: !831, templateParams: !208, identifier: "7961fb9ba469d0c7c6af5527b8ecc7f7", discriminator: !876)
!831 = !{!832, !854, !858, !872}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !830, file: !13, baseType: !833, size: 128, align: 64, extraData: i64 0)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !828, file: !13, size: 128, align: 64, elements: !834, templateParams: !837, identifier: "c8407fa94eb4b8709fb5b3466950a09f")
!834 = !{!835}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !833, file: !13, baseType: !836, size: 32, align: 32, offset: 32)
!836 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!837 = !{!838}
!838 = !DITemplateTypeParameter(name: "C", type: !839)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !840, size: 64, align: 64, dwarfAddressSpace: 0)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !25, file: !13, size: 192, align: 64, elements: !841, templateParams: !208, identifier: "2f07fd9f0ceaf250c6f461585c32091f")
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !840, file: !13, baseType: !24, size: 8, align: 8, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !840, file: !13, baseType: !844, size: 128, align: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn std::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !13, size: 128, align: 64, elements: !845, templateParams: !208, identifier: "a2e388dc44788481df250f2a18b5f2da")
!845 = !{!846, !849}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !844, file: !13, baseType: !847, size: 64, align: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64, align: 64, dwarfAddressSpace: 0)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn std::error::Error + core::marker::Send + core::marker::Sync)", file: !13, align: 8, elements: !208, identifier: "f647a20cf102dc05616ead757c960d4")
!849 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !844, file: !13, baseType: !850, size: 64, align: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !851, size: 64, align: 64, dwarfAddressSpace: 0)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 192, align: 64, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 3, lowerBound: 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !830, file: !13, baseType: !855, size: 128, align: 64, extraData: i64 1)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !828, file: !13, size: 128, align: 64, elements: !856, templateParams: !837, identifier: "c3bf0a04aba447abbd93ec049bab8102")
!856 = !{!857}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !855, file: !13, baseType: !24, size: 8, align: 8, offset: 8)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !830, file: !13, baseType: !859, size: 128, align: 64, extraData: i64 2)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !828, file: !13, size: 128, align: 64, elements: !860, templateParams: !837, identifier: "441c8172c734882f51000e2d1044f82f")
!860 = !{!861}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !859, file: !13, baseType: !862, size: 64, align: 64, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !863, size: 64, align: 64, dwarfAddressSpace: 0)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !25, file: !13, size: 192, align: 64, elements: !864, templateParams: !208, identifier: "3cdb7a7e1e42ed545fad28826f922e25")
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !863, file: !13, baseType: !24, size: 8, align: 8, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !863, file: !13, baseType: !867, size: 128, align: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !13, size: 128, align: 64, elements: !868, templateParams: !208, identifier: "c603ebb2af364502ef89131a86c6ad9b")
!868 = !{!869, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !867, file: !13, baseType: !870, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !867, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !830, file: !13, baseType: !873, size: 128, align: 64, extraData: i64 3)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !828, file: !13, size: 128, align: 64, elements: !874, templateParams: !837, identifier: "ae5912c227aad0ad733c336685b6d35d")
!874 = !{!875}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !873, file: !13, baseType: !839, size: 64, align: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, scope: !828, file: !13, baseType: !18, size: 8, align: 8, flags: DIFlagArtificial)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !791, file: !13, baseType: !878, size: 192, align: 64, extraData: i64 1)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !788, file: !13, size: 192, align: 64, elements: !879, templateParams: !809, identifier: "cdb502f4b17cb4b2e934d5144ca7dc66")
!879 = !{!880}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !878, file: !13, baseType: !812, size: 64, align: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, scope: !788, file: !13, baseType: !79, size: 64, align: 64, flags: DIFlagArtificial)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "<std::path::PathBuf as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !884, isLocal: true, isDefinition: true)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<std::path::PathBuf as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !885, vtableHolder: !890, templateParams: !208, identifier: "1836cd43bee992fb80171e569ff7d15")
!885 = !{!886, !887, !888, !889}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !884, file: !13, baseType: !160, size: 64, align: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !884, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !884, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !884, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PathBuf", scope: !720, file: !13, size: 192, align: 64, elements: !891, templateParams: !208, identifier: "71dfedfd007484587785bad318abc70e")
!891 = !{!892}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !890, file: !13, baseType: !893, size: 192, align: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OsString", scope: !894, file: !13, size: 192, align: 64, elements: !896, templateParams: !208, identifier: "5b8608b67e00de812849292fbc8916ea")
!894 = !DINamespace(name: "os_str", scope: !895)
!895 = !DINamespace(name: "ffi", scope: !27)
!896 = !{!897}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !893, file: !13, baseType: !898, size: 192, align: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Buf", scope: !899, file: !13, size: 192, align: 64, elements: !900, templateParams: !208, identifier: "59ec4ed90b3f94fe5ae06fe460a8d1b8")
!899 = !DINamespace(name: "os_str", scope: !638)
!900 = !{!901}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !898, file: !13, baseType: !185, size: 192, align: 64)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "<std::sys::unix::fd::FileDesc as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !904, isLocal: true, isDefinition: true)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<std::sys::unix::fd::FileDesc as core::fmt::Debug>::{vtable_type}", file: !13, size: 256, align: 64, flags: DIFlagArtificial, elements: !905, vtableHolder: !910, templateParams: !208, identifier: "47927ec98bf13f53fb81c9c2e0be2f4a")
!905 = !{!906, !907, !908, !909}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !904, file: !13, baseType: !160, size: 64, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !904, file: !13, baseType: !163, size: 64, align: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !904, file: !13, baseType: !163, size: 64, align: 64, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !904, file: !13, baseType: !160, size: 64, align: 64, offset: 192)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileDesc", scope: !911, file: !13, size: 32, align: 32, elements: !912, templateParams: !208, identifier: "1925dab86925cd04e20d30300915e65d")
!911 = !DINamespace(name: "fd", scope: !638)
!912 = !{!913}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !910, file: !13, baseType: !914, size: 32, align: 32)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OwnedFd", scope: !915, file: !13, size: 32, align: 32, elements: !918, templateParams: !208, identifier: "140107570618159cc0699467a83f7")
!915 = !DINamespace(name: "owned", scope: !916)
!916 = !DINamespace(name: "fd", scope: !917)
!917 = !DINamespace(name: "os", scope: !27)
!918 = !{!919}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !914, file: !13, baseType: !836, size: 32, align: 32)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "<std::os::unix::net::addr::SocketAddr as core::fmt::Debug>::{vtable}", scope: null, file: !13, type: !922, isLocal: true, isDefinition: true)
